---
kind: enumMember
id: F:Autodesk.Revit.DB.ResolutionTarget.Printer
enum: Autodesk.Revit.DB.ResolutionTarget
source: html/3292e978-ddb2-0942-ee63-f783e7d15117.htm
---
# Autodesk.Revit.DB.ResolutionTarget.Printer

Uses printer resolution for rendering output settings.